RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl702/std/src/bl702_hbn.c
    hbnInt1CbfArra[intType] = cbFun;

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  HBN GPIO debug pull config
 *
 * @param  pupdEn: Enable or disable GPIO pull down and pull up
 * @param  dlyEn: Enable or disable GPIO wakeup delay function
 * @param  dlySec: GPIO wakeup delay sec 1 to 7
 * @param  gpioIrq: HBN GPIO num
 * @param  gpioMask: HBN GPIO MASK or UNMASK
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
BL_Err_Type ATTR_TCM_SECTION HBN_GPIO_Dbg_Pull_Cfg(BL_Fun_Type pupdEn, BL_Fun_Type dlyEn, uint8_t dlySec, HBN_INT_Type gpioIrq, BL_Mask_Type gpioMask)
{
    uint32_t tmpVal;

    CHECK_PARAM(((dlySec >= 1) && (dlySec <= 7)));
    CHECK_PARAM((gpioIrq >= HBN_INT_GPIO9) && (gpioIrq <= HBN_INT_GPIO13));

    tmpVal = BL_RD_REG(HBN_BASE, HBN_IRQ_MODE);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, HBN_PIN_WAKEUP_EN, dlyEn);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, HBN_PIN_WAKEUP_SEL, dlySec);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, HBN_REG_EN_HW_PU_PD, pupdEn);

    if (gpioMask != UNMASK) {
        tmpVal = tmpVal | (1 << (gpioIrq + 8));
    } else {
        tmpVal = tmpVal & ~(1 << (gpioIrq + 8));
    }

    BL_WR_REG(HBN_BASE, HBN_IRQ_MODE, tmpVal);

    return SUCCESS;
}
#endif

/****************************************************************************/ /**
 * @brief  Set pad 23-28 pull none
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_TCM_SECTION HBN_Set_Pad_23_28_Pullnone(void)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(HBN_BASE, HBN_MISC);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, HBN_FLASH_PULLDOWN_AON, 0x00);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, HBN_FLASH_PULLUP_AON, 0x00);
    BL_WR_REG(HBN_BASE, HBN_MISC, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Set pad 23-28 pull up
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_TCM_SECTION HBN_Set_Pad_23_28_Pullup(void)
{
    uint32_t tmpVal = 0;

    /********************************************/
    /* GPIO28 is bootpin, so leave it pull none */
    /********************************************/

    tmpVal = BL_RD_REG(HBN_BASE, HBN_MISC);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, HBN_FLASH_PULLDOWN_AON, 0x00);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, HBN_FLASH_PULLUP_AON, 0x1F);
    BL_WR_REG(HBN_BASE, HBN_MISC, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Set pad 23-28 pull down
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_TCM_SECTION HBN_Set_Pad_23_28_Pulldown(void)
{
    uint32_t tmpVal = 0;

    /********************************************/
    /* GPIO28 is bootpin, so leave it pull none */
    /********************************************/

    tmpVal = BL_RD_REG(HBN_BASE, HBN_MISC);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, HBN_FLASH_PULLDOWN_AON, 0x1F);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, HBN_FLASH_PULLUP_AON, 0x00);
    BL_WR_REG(HBN_BASE, HBN_MISC, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Set pad 23-28 active ie
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_TCM_SECTION HBN_Set_Pad_23_28_ActiveIE(void)
{
    uint32_t tmpVal = 0;

    /********************************************/
    /* GPIO28 is bootpin, so leave it pull none */
    /********************************************/

    tmpVal = BL_RD_REG(HBN_BASE, HBN_MISC);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, HBN_FLASH_PULLDOWN_AON, 0x1F);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, HBN_FLASH_PULLUP_AON, 0x1F);
    BL_WR_REG(HBN_BASE, HBN_MISC, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Set BOR config
 *
 * @param  cfg: Enable or disable
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type HBN_Set_BOR_Cfg(HBN_BOR_CFG_Type *cfg)
{
    uint32_t tmpVal = 0;

    if (cfg->enableBorInt) {
        HBN_Enable_BOR_IRQ();
    } else {
        HBN_Disable_BOR_IRQ();
    }

    tmpVal = BL_RD_REG(HBN_BASE, HBN_MISC);

    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, HBN_BOR_VTH, cfg->borThreshold);

    if (cfg->enablePorInBor) {
        tmpVal = BL_SET_REG_BIT(tmpVal, HBN_BOR_SEL);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, HBN_BOR_SEL);
    }

    if (cfg->enableBor) {
        tmpVal = BL_SET_REG_BIT(tmpVal, HBN_PU_BOR);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, HBN_PU_BOR);
    }

    BL_WR_REG(HBN_BASE, HBN_MISC, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  HBN OUT0 interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void HBN_OUT0_IRQHandler(void)
{
    if (SET == HBN_Get_INT_State(HBN_INT_GPIO9)) {
        HBN_Clear_IRQ(HBN_INT_GPIO9);

        if (hbnInt0CbfArra[HBN_OUT0_INT_GPIO9] != NULL) {
            hbnInt0CbfArra[HBN_OUT0_INT_GPIO9]();
        }
    }

    if (SET == HBN_Get_INT_State(HBN_INT_GPIO10)) {
        HBN_Clear_IRQ(HBN_INT_GPIO10);

        if (hbnInt0CbfArra[HBN_OUT0_INT_GPIO10] != NULL) {
            hbnInt0CbfArra[HBN_OUT0_INT_GPIO10]();
        }
    }

    if (SET == HBN_Get_INT_State(HBN_INT_GPIO11)) {
        HBN_Clear_IRQ(HBN_INT_GPIO11);

        if (hbnInt0CbfArra[HBN_OUT0_INT_GPIO11] != NULL) {
            hbnInt0CbfArra[HBN_OUT0_INT_GPIO11]();
        }
    }

